jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x32x.cpp
#ifndef P0OUT_0
#define P0OUT_0 0x01
#endif
#ifndef P0OUT_1
#define P0OUT_1 0x02
#endif
#ifndef P0OUT_2
#define P0OUT_2 0x04
#endif
#ifndef P0OUT_3
#define P0OUT_3 0x08
#endif
#ifndef P0OUT_4
#define P0OUT_4 0x10
#endif
#ifndef P0OUT_5
#define P0OUT_5 0x20
#endif
#ifndef P0OUT_6
#define P0OUT_6 0x40
#endif
#ifndef EN1FG
#define EN1FG 0x01
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef __FLT_MIN_
#define __FLT_MIN_ 1.17549435e-38F
#endif
#ifndef SCFQ_512K
#define SCFQ_512K 0x0F
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef __ASSEMBLER_
#define __ASSEMBLER_ 1
#endif
#ifndef TCCTL_
#define TCCTL_ 0x0042
#endif
#ifndef TCCTL
#define TCCTL 0x0042
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef __CHAR_BIT_
#define __CHAR_BIT_ 8
#endif
#ifndef __MSP430_HAS_BT__
#define __MSP430_HAS_BT__ 
#endif
#ifndef __MSP430_HAS_BT_
#define __MSP430_HAS_BT_ 
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef __WINT_MAX_
#define __WINT_MAX_ 65535U
#endif
#ifndef BTCTL_
#define BTCTL_ 0x0040
#endif
#ifndef BTCTL
#define BTCTL 0x0040
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef __SIZE_MAX_
#define __SIZE_MAX_ 65535U
#endif
#ifndef LCDM10_
#define LCDM10_ LCD_BASE+0xA
#endif
#ifndef LCDM10
#define LCDM10 LCD_BASE+0xA
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef __WCHAR_MAX_
#define __WCHAR_MAX_ 32767
#endif
#ifndef CBSEL0
#define CBSEL0 0x02
#endif
#ifndef CBSEL1
#define CBSEL1 0x04
#endif
#ifndef LCDM11_
#define LCDM11_ LCD_BASE+0xB
#endif
#ifndef LCDM11
#define LCDM11 LCD_BASE+0xB
#endif
#ifndef P0IE_
#define P0IE_ 0x0015
#endif
#ifndef P0IE
#define P0IE 0x0015
#endif
#ifndef SCFQ_256K
#define SCFQ_256K 0x07
#endif
#ifndef ADINOFF
#define ADINOFF 0x0020
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef __FLT_EVAL_METHOD_
#define __FLT_EVAL_METHOD_ 0
#endif
#ifndef LCDM13_
#define LCDM13_ LCD_BASE+0xD
#endif
#ifndef LCDM13
#define LCDM13 LCD_BASE+0xD
#endif
#ifndef TPSSEL_CLK1_MCLK
#define TPSSEL_CLK1_MCLK TPSSEL1
#endif
#ifndef LCDM14_
#define LCDM14_ LCD_BASE+0xE
#endif
#ifndef LCDM14
#define LCDM14 LCD_BASE+0xE
#endif
#ifndef LCDM15_
#define LCDM15_ LCD_BASE+0xF
#endif
#ifndef LCDM15
#define LCDM15 LCD_BASE+0xF
#endif
#ifndef LCDLOWR
#define LCDLOWR 0x02
#endif
#ifndef __MSP430_HAS_EPROM__
#define __MSP430_HAS_EPROM__ 
#endif
#ifndef __MSP430_HAS_EPROM_
#define __MSP430_HAS_EPROM_ 
#endif
#ifndef TPCTL_
#define TPCTL_ 0x004B
#endif
#ifndef TPCTL
#define TPCTL 0x004B
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef __FINITE_MATH_ONLY_
#define __FINITE_MATH_ONLY_ 0
#endif
#ifndef TCRXD
#define TCRXD 0x01
#endif
#ifndef P0IES_
#define P0IES_ 0x0014
#endif
#ifndef P0IES
#define P0IES 0x0014
#endif
#ifndef ADCSRC0
#define ADCSRC0 0x0040
#endif
#ifndef ADCSRC1
#define ADCSRC1 0x0080
#endif
#ifndef P0IN_
#define P0IN_ 0x0010
#endif
#ifndef P0IN
#define P0IN 0x0010
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef __GNUC_PATCHLEVEL_
#define __GNUC_PATCHLEVEL_ 3
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef __DEC64_MAX_EXP_
#define __DEC64_MAX_EXP_ 385
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef __SHRT_MAX_
#define __SHRT_MAX_ 32767
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef __LDBL_MAX_
#define __LDBL_MAX_ 3.40282347e+38L
#endif
#ifndef P0OUT_7
#define P0OUT_7 0x80
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef LCD_BASE
#define LCD_BASE 0x30
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef BT_fCLK2_DIV2
#define BT_fCLK2_DIV2 0
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef __UINTMAX_TYPE_
#define __UINTMAX_TYPE_ long long unsigned int
#endif
#ifndef P0IE_2
#define P0IE_2 0x04
#endif
#ifndef P0IE_3
#define P0IE_3 0x08
#endif
#ifndef P0IE_4
#define P0IE_4 0x10
#endif
#ifndef P0IE_5
#define P0IE_5 0x20
#endif
#ifndef P0IE_6
#define P0IE_6 0x40
#endif
#ifndef P0IE_7
#define P0IE_7 0x80
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef __DEC32_EPSILON_
#define __DEC32_EPSILON_ 1E-6DF
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef __LDBL_MAX_EXP_
#define __LDBL_MAX_EXP_ 128
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef __WINT_MIN_
#define __WINT_MIN_ 0U
#endif
#ifndef CBSEL_ACLK
#define CBSEL_ACLK 0
#endif
#ifndef TPSSEL_CLK2_MCLK
#define TPSSEL_CLK2_MCLK TPSSEL3
#endif
#ifndef TCDAT
#define TCDAT 0x0044
#endif
#ifndef LCDM12_
#define LCDM12_ LCD_BASE+0xC
#endif
#ifndef LCDM12
#define LCDM12 LCD_BASE+0xC
#endif
#ifndef ADAT_
#define ADAT_ 0x0118
#endif
#ifndef ADAT
#define ADAT 0x0118
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef __SCHAR_MAX_
#define __SCHAR_MAX_ 127
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef __DBL_DIG_
#define __DBL_DIG_ 6
#endif
#ifndef LCDCTL_
#define LCDCTL_ LCD_BASE
#endif
#ifndef LCDCTL
#define LCDCTL LCD_BASE
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_INT_
#define __SIZEOF_INT_ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef __SIZEOF_POINTER_
#define __SIZEOF_POINTER_ 2
#endif
#ifndef __msp430_headers_timerport_h
#define __msp430_headers_timerport_h 
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef __USER_LABEL_PREFIX_
#define __USER_LABEL_PREFIX_ 
#endif
#ifndef CBE
#define CBE 0x01
#endif
#ifndef TPE_0
#define TPE_0 0x01
#endif
#ifndef TPE_1
#define TPE_1 0x02
#endif
#ifndef TPE_2
#define TPE_2 0x04
#endif
#ifndef TPE_3
#define TPE_3 0x08
#endif
#ifndef TPE_4
#define TPE_4 0x10
#endif
#ifndef TPE_5
#define TPE_5 0x20
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __STDC_HOSTED_
#define __STDC_HOSTED_ 1
#endif
#ifndef __MSP430_HAS_PORT0__
#define __MSP430_HAS_PORT0__ 
#endif
#ifndef __MSP430_HAS_PORT0_
#define __MSP430_HAS_PORT0_ 
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef __LDBL_HAS_INFINITY_
#define __LDBL_HAS_INFINITY_ 1
#endif
#ifndef IO1_VECTOR
#define IO1_VECTOR 24
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef __FLT_EPSILON_
#define __FLT_EPSILON_ 1.19209290e-7F
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef __MSP430_
#define __MSP430_ 1
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef __LDBL_MIN_
#define __LDBL_MIN_ 1.17549435e-38L
#endif
#ifndef P0DIR_4
#define P0DIR_4 0x10
#endif
#ifndef __msp430_headers_system_clock_h
#define __msp430_headers_system_clock_h 
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef __DEC32_MAX_
#define __DEC32_MAX_ 9.999999E96DF
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef __SIZEOF_LONG_
#define __SIZEOF_LONG_ 4
#endif
#ifndef TPCNT1_
#define TPCNT1_ 0x004C
#endif
#ifndef TPCNT1
#define TPCNT1 0x004C
#endif
#ifndef TPCNT2_
#define TPCNT2_ 0x004D
#endif
#ifndef TPCNT2
#define TPCNT2 0x004D
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef __DECIMAL_DIG_
#define __DECIMAL_DIG_ 9
#endif
#ifndef EPEXE
#define EPEXE 0x01
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __LDBL_HAS_QUIET_NAN_
#define __LDBL_HAS_QUIET_NAN_ 1
#endif
#ifndef TCSSEL_P01
#define TCSSEL_P01 0
#endif
#ifndef __MSP430_HAS_FLL__
#define __MSP430_HAS_FLL__ 
#endif
#ifndef __MSP430_HAS_FLL_
#define __MSP430_HAS_FLL_ 
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef __GNUC_
#define __GNUC_ 4
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __FLT_HAS_DENORM_
#define __FLT_HAS_DENORM_ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef __SIZEOF_LONG_DOUBLE_
#define __SIZEOF_LONG_DOUBLE_ 4
#endif
#ifndef TPCNT1_EN_OFF
#define TPCNT1_EN_OFF 0
#endif
#ifndef RC1FG
#define RC1FG 0x02
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef __BIGGEST_ALIGNMENT_
#define __BIGGEST_ALIGNMENT_ 2
#endif
#ifndef TCENCNT
#define TCENCNT 0x08
#endif
#ifndef ADRNG_A
#define ADRNG_A 0
#endif
#ifndef LCDSG0
#define LCDSG0 0x00
#endif
#ifndef P0IFG_
#define P0IFG_ 0x0013
#endif
#ifndef P0IFG
#define P0IFG 0x0013
#endif
#ifndef BT_ADLY_0_064
#define BT_ADLY_0_064 0
#endif
#ifndef BTRESET
#define BTRESET 0x40
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef __DBL_HAS_INFINITY_
#define __DBL_HAS_INFINITY_ 1
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef BTFRFQ0
#define BTFRFQ0 0x08
#endif
#ifndef BTFRFQ1
#define BTFRFQ1 0x10
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef EPVPPS
#define EPVPPS 0x02
#endif
#ifndef __msp430_headers_timer8_h
#define __msp430_headers_timer8_h 
#endif
#ifndef ADIN0
#define ADIN0 0x0004
#endif
#ifndef ADIN1
#define ADIN1 0x0008
#endif
#ifndef ADIN2
#define ADIN2 0x0010
#endif
#ifndef TCRXACT
#define TCRXACT 0x04
#endif
#ifndef ADSVCC
#define ADSVCC 0x0002
#endif
#ifndef BT_fLCD_1K
#define BT_fLCD_1K 0
#endif
#ifndef LCDSON
#define LCDSON 0x04
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef __LDBL_HAS_DENORM_
#define __LDBL_HAS_DENORM_ 1
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __DEC128_MAX_
#define __DEC128_MAX_ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __USING_SJLJ_EXCEPTIONS_
#define __USING_SJLJ_EXCEPTIONS_ 1
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef __DEC32_MIN_
#define __DEC32_MIN_ 1E-95DF
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef __DBL_MAX_EXP_
#define __DBL_MAX_EXP_ 128
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef __DEC128_EPSILON_
#define __DEC128_EPSILON_ 1E-33DL
#endif
#ifndef __MSP430_HAS_TP__
#define __MSP430_HAS_TP__ 
#endif
#ifndef __MSP430_HAS_TP_
#define __MSP430_HAS_TP_ 
#endif
#ifndef SCFQ_1M
#define SCFQ_1M 0x1F
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef __PTRDIFF_MAX_
#define __PTRDIFF_MAX_ 2147483647L
#endif
#ifndef TPSSEL_CLK2_TPIN5
#define TPSSEL_CLK2_TPIN5 0
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef __MSP430_HAS_WDT_
#define __MSP430_HAS_WDT_ 
#endif
#ifndef SCFQ_2M
#define SCFQ_2M 0x3F
#endif
#ifndef BT_fCLK2_ACLK
#define BT_fCLK2_ACLK 0x00
#endif
#ifndef SCFQ_4M
#define SCFQ_4M 0x7F
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef __LONG_LONG_MAX_
#define __LONG_LONG_MAX_ 9223372036854775807LL
#endif
#ifndef CPON
#define CPON 0x40
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef __SIZEOF_SIZE_T_
#define __SIZEOF_SIZE_T_ 2
#endif
#ifndef TPSSEL_CLK1_CIN
#define TPSSEL_CLK1_CIN 0
#endif
#ifndef ADPD
#define ADPD 0x1000
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef IE1
#define IE1 0x0000
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef __SIZEOF_WINT_T_
#define __SIZEOF_WINT_T_ 2
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef IE2
#define IE2 0x0001
#endif
#ifndef IO0_VECTOR
#define IO0_VECTOR 26
#endif
#ifndef RC2FG
#define RC2FG 0x04
#endif
#ifndef P0DIR_
#define P0DIR_ 0x0012
#endif
#ifndef P0DIR
#define P0DIR 0x0012
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef TPD_
#define TPD_ 0x004E
#endif
#ifndef TPD
#define TPD 0x004E
#endif
#ifndef ADCSRCOFF
#define ADCSRCOFF 0x0100
#endif
#ifndef TPE_
#define TPE_ 0x004F
#endif
#ifndef TPE
#define TPE 0x004F
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef IFG1
#define IFG1 0x0002
#endif
#ifndef ADIN_A0
#define ADIN_A0 0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef __MSP430_IVCNT_
#define __MSP430_IVCNT_ 16
#endif
#ifndef __MSP430_HAS_LCD__
#define __MSP430_HAS_LCD__ 
#endif
#ifndef __MSP430_HAS_LCD_
#define __MSP430_HAS_LCD_ 
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef BTSSEL
#define BTSSEL 0x80
#endif
#ifndef P0IES_0
#define P0IES_0 0x01
#endif
#ifndef P0IES_1
#define P0IES_1 0x02
#endif
#ifndef P0IES_2
#define P0IES_2 0x04
#endif
#ifndef P0IES_3
#define P0IES_3 0x08
#endif
#ifndef P0IES_4
#define P0IES_4 0x10
#endif
#ifndef P0IES_5
#define P0IES_5 0x20
#endif
#ifndef P0IES_6
#define P0IES_6 0x40
#endif
#ifndef P0IES_7
#define P0IES_7 0x80
#endif
#ifndef BTHOLD
#define BTHOLD 0x40
#endif
#ifndef CBCTL_
#define CBCTL_ 0x0053
#endif
#ifndef CBCTL
#define CBCTL 0x0053
#endif
#ifndef ADSOC
#define ADSOC 0x0001
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __DEC128_MIN_
#define __DEC128_MIN_ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __REGISTER_PREFIX_
#define __REGISTER_PREFIX_ 
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef __DBL_HAS_DENORM_
#define __DBL_HAS_DENORM_ 1
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __NO_INLINE_
#define __NO_INLINE_ 1
#endif
#ifndef __MSP430_HAS_ADC14__
#define __MSP430_HAS_ADC14__ 
#endif
#ifndef __MSP430_HAS_ADC14_
#define __MSP430_HAS_ADC14_ 
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __FLT_MANT_DIG_
#define __FLT_MANT_DIG_ 24
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef __VERSION_
#define __VERSION_ "4.5.3"
#endif
#ifndef TCPLD
#define TCPLD 0x0043
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef WDTCTL
#define WDTCTL 0x0120
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef __IOMACROS_H
#define __IOMACROS_H 
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef P0IFG_2
#define P0IFG_2 0x04
#endif
#ifndef P0IFG_3
#define P0IFG_3 0x08
#endif
#ifndef P0IFG_4
#define P0IFG_4 0x10
#endif
#ifndef P0IFG_5
#define P0IFG_5 0x20
#endif
#ifndef P0IFG_6
#define P0IFG_6 0x40
#endif
#ifndef P0IFG_7
#define P0IFG_7 0x80
#endif
#ifndef TPCNT1_EN_nTPIN5
#define TPCNT1_EN_nTPIN5 ENB
#endif
#ifndef __msp430x32x
#define __msp430x32x 
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef __DEC64_EPSILON_
#define __DEC64_EPSILON_ 1E-15DD
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __SIZE_TYPE_
#define __SIZE_TYPE_ unsigned int
#endif
#ifndef LCDM1_
#define LCDM1_ LCDMEM_
#endif
#ifndef LCDM1
#define LCDM1 LCDMEM_
#endif
#ifndef BTDIV
#define BTDIV 0x20
#endif
#ifndef AIN_
#define AIN_ 0x0110
#endif
#ifndef AIN
#define AIN 0x0110
#endif
#ifndef LCDM2_
#define LCDM2_ LCD_BASE+0x2
#endif
#ifndef LCDM2
#define LCDM2 LCD_BASE+0x2
#endif
#ifndef BT_fLCD_DIV32
#define BT_fLCD_DIV32 0
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LCDM3_
#define LCDM3_ LCD_BASE+0x3
#endif
#ifndef LCDM3
#define LCDM3 LCD_BASE+0x3
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef LCDM4_
#define LCDM4_ LCD_BASE+0x4
#endif
#ifndef LCDM4
#define LCDM4 LCD_BASE+0x4
#endif
#ifndef __msp430_headers_eprom_h
#define __msp430_headers_eprom_h 
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef __FLT_RADIX_
#define __FLT_RADIX_ 2
#endif
#ifndef LCDM5_
#define LCDM5_ LCD_BASE+0x5
#endif
#ifndef LCDM5
#define LCDM5 LCD_BASE+0x5
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef __LDBL_EPSILON_
#define __LDBL_EPSILON_ 1.19209290e-7L
#endif
#ifndef LCDM6_
#define LCDM6_ LCD_BASE+0x6
#endif
#ifndef LCDM6
#define LCDM6 LCD_BASE+0x6
#endif
#ifndef P0DIR_3
#define P0DIR_3 0x08
#endif
#ifndef P0IN_0
#define P0IN_0 0x01
#endif
#ifndef P0IN_1
#define P0IN_1 0x02
#endif
#ifndef P0IN_2
#define P0IN_2 0x04
#endif
#ifndef P0IN_3
#define P0IN_3 0x08
#endif
#ifndef P0IN_4
#define P0IN_4 0x10
#endif
#ifndef P0IN_5
#define P0IN_5 0x20
#endif
#ifndef P0IN_6
#define P0IN_6 0x40
#endif
#ifndef P0IN_7
#define P0IN_7 0x80
#endif
#ifndef LCDM7_
#define LCDM7_ LCD_BASE+0x7
#endif
#ifndef LCDM7
#define LCDM7 LCD_BASE+0x7
#endif
#ifndef TCSSEL0
#define TCSSEL0 0x40
#endif
#ifndef TCSSEL1
#define TCSSEL1 0x80
#endif
#ifndef LCDM8_
#define LCDM8_ LCD_BASE+0x8
#endif
#ifndef LCDM8
#define LCDM8 LCD_BASE+0x8
#endif
#ifndef LCDM9_
#define LCDM9_ LCD_BASE+0x9
#endif
#ifndef LCDM9
#define LCDM9 LCD_BASE+0x9
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef __SIZEOF_PTRDIFF_T_
#define __SIZEOF_PTRDIFF_T_ 4
#endif
#ifndef P0OUT_
#define P0OUT_ 0x0011
#endif
#ifndef P0OUT
#define P0OUT 0x0011
#endif
#ifndef EPCTL_
#define EPCTL_ 0x0054
#endif
#ifndef EPCTL
#define EPCTL 0x0054
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef __DEC32_SUBNORMAL_MIN_
#define __DEC32_SUBNORMAL_MIN_ 0.000001E-95DF
#endif
#ifndef TCTXD
#define TCTXD 0x02
#endif
#ifndef TCTXE
#define TCTXE 0x10
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef LCDMA_
#define LCDMA_ LCDM10_
#endif
#ifndef LCDMA
#define LCDMA LCDM10_
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef __MSP430F110_
#define __MSP430F110_ 1
#endif
#ifndef LCDMEM_
#define LCDMEM_ LCD_BASE+1
#endif
#ifndef LCDMEM
#define LCDMEM LCD_BASE+1
#endif
#ifndef LCDMB_
#define LCDMB_ LCDM11_
#endif
#ifndef LCDMB
#define LCDMB LCDM11_
#endif
#ifndef AEN_
#define AEN_ 0x0112
#endif
#ifndef AEN
#define AEN 0x0112
#endif
#ifndef LCDMC_
#define LCDMC_ LCDM12_
#endif
#ifndef LCDMC
#define LCDMC LCDM12_
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_HAS_QUIET_NAN_
#define __FLT_HAS_QUIET_NAN_ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef __FLT_MAX_10_EXP_
#define __FLT_MAX_10_EXP_ 38
#endif
#ifndef LCDMD_
#define LCDMD_ LCDM13_
#endif
#ifndef LCDMD
#define LCDMD LCDM13_
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __LONG_MAX_
#define __LONG_MAX_ 2147483647L
#endif
#ifndef PORT0_VECTOR
#define PORT0_VECTOR 0
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __DEC128_SUBNORMAL_MIN_
#define __DEC128_SUBNORMAL_MIN_ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef LCDMEM
#define LCDMEM LCDMEM_
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef __FLT_HAS_INFINITY_
#define __FLT_HAS_INFINITY_ 1
#endif
#ifndef LCDME_
#define LCDME_ LCDM14_
#endif
#ifndef LCDME
#define LCDME LCDM14_
#endif
#ifndef BT_fCLK2_MCLK
#define BT_fCLK2_MCLK BTSSEL
#endif
#ifndef __MSP430_HAS_8BTC__
#define __MSP430_HAS_8BTC__ 
#endif
#ifndef __MSP430_HAS_8BTC_
#define __MSP430_HAS_8BTC_ 
#endif
#ifndef LCDMF_
#define LCDMF_ LCDM15_
#endif
#ifndef LCDMF
#define LCDMF LCDM15_
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef __DEC64_MAX_
#define __DEC64_MAX_ 9.999999999999999E384DD
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef __CHAR16_TYPE_
#define __CHAR16_TYPE_ short unsigned int
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef __DEC64_MANT_DIG_
#define __DEC64_MANT_DIG_ 16
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef __DEC32_MAX_EXP_
#define __DEC32_MAX_EXP_ 97
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef ADAUTO
#define ADAUTO 0x0800
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef __LDBL_MANT_DIG_
#define __LDBL_MANT_DIG_ 24
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __DBL_HAS_QUIET_NAN_
#define __DBL_HAS_QUIET_NAN_ 1
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __WCHAR_TYPE_
#define __WCHAR_TYPE_ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef __SIZEOF_FLOAT_
#define __SIZEOF_FLOAT_ 4
#endif
#ifndef LCDMX0
#define LCDMX0 0x08
#endif
#ifndef LCDMX1
#define LCDMX1 0x10
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef TPD_0
#define TPD_0 0x01
#endif
#ifndef LCDOG1_7
#define LCDOG1_7 0x00
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef __FLT_DIG_
#define __FLT_DIG_ 6
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef __MSPGCC_
#define __MSPGCC_ 20110706
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef __INT_MAX_
#define __INT_MAX_ 32767
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef __FLT_MAX_EXP_
#define __FLT_MAX_EXP_ 128
#endif
#ifndef ADCSRC_A0
#define ADCSRC_A0 0
#endif
#ifndef TPSSEL_CLK1_ACLK
#define TPSSEL_CLK1_ACLK TPSSEL0
#endif
#ifndef BASICTIMER_VECTOR
#define BASICTIMER_VECTOR 2
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef __DBL_MANT_DIG_
#define __DBL_MANT_DIG_ 24
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef __DEC64_MIN_
#define __DEC64_MIN_ 1E-383DD
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __WINT_TYPE_
#define __WINT_TYPE_ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef __SIZEOF_SHORT_
#define __SIZEOF_SHORT_ 2
#endif
#ifndef EN1
#define EN1 0x08
#endif
#ifndef ENA
#define ENA 0x10
#endif
#ifndef ENB
#define ENB 0x20
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef IFG2
#define IFG2 0x0003
#endif
#ifndef ADRNG0
#define ADRNG0 0x0200
#endif
#ifndef ADRNG1
#define ADRNG1 0x0400
#endif
#ifndef LCDON
#define LCDON 0x01
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_MAX_10_EXP_
#define __LDBL_MAX_10_EXP_ 38
#endif
#ifndef LCDP0
#define LCDP0 0x20
#endif
#ifndef LCDP1
#define LCDP1 0x40
#endif
#ifndef LCDP2
#define LCDP2 0x80
#endif
#ifndef TIMERPORT_VECTOR
#define TIMERPORT_VECTOR 8
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef __SIZEOF_WCHAR_T_
#define __SIZEOF_WCHAR_T_ 2
#endif
#ifndef BTCNT1_
#define BTCNT1_ 0x0046
#endif
#ifndef BTCNT1
#define BTCNT1 0x0046
#endif
#ifndef TCISCTL
#define TCISCTL 0x20
#endif
#ifndef BTCNT2_
#define BTCNT2_ 0x0047
#endif
#ifndef BTCNT2
#define BTCNT2 0x0047
#endif
#ifndef ADC_VECTOR
#define ADC_VECTOR 10
#endif
#ifndef B16
#define B16 0x80
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef __DEC_EVAL_METHOD_
#define __DEC_EVAL_METHOD_ 2
#endif
