jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x32x.cpp
		unsigned int getTA1CCTL0() {
#ifdef TA1CCTL0_
			return TA1CCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL1() {
#ifdef TA1CCTL1_
			return TA1CCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL2() {
#ifdef TA1CCTL2_
			return TA1CCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL3() {
#ifdef TA1CCTL3_
			return TA1CCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL4() {
#ifdef TA1CCTL4_
			return TA1CCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTA0IV() {
#ifdef TA0IV_
			return TA0IV_;
#else
			return 0;
#endif
		}


		unsigned int getTA1IV() {
#ifdef TA1IV_
			return TA1IV_;
#else
			return 0;
#endif
		}


		unsigned int getTIMERA0_VECTOR() {
#ifdef TIMERA0_VECTOR
			return TIMERA0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMERA1_VECTOR() {
#ifdef TIMERA1_VECTOR
			return TIMERA1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER0_A0_VECTOR() {
#ifdef TIMER0_A0_VECTOR
			return TIMER0_A0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER0_A1_VECTOR() {
#ifdef TIMER0_A1_VECTOR
			return TIMER0_A1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER1_A0_VECTOR() {
#ifdef TIMER1_A0_VECTOR
			return TIMER1_A0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER1_A1_VECTOR() {
#ifdef TIMER1_A1_VECTOR
			return TIMER1_A1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTBR() {
#ifdef TBR_
			return TBR_;
#else
			return 0;
#endif
		}


		unsigned int getTBCTL() {
#ifdef TBCTL_
			return TBCTL_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR0() {
#ifdef TBCCR0_
			return TBCCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR1() {
#ifdef TBCCR1_
			return TBCCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR2() {
#ifdef TBCCR2_
			return TBCCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR3() {
#ifdef TBCCR3_
			return TBCCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR4() {
#ifdef TBCCR4_
			return TBCCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR5() {
#ifdef TBCCR5_
			return TBCCR5_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR6() {
#ifdef TBCCR6_
			return TBCCR6_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL0() {
#ifdef TBCCTL0_
			return TBCCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL1() {
#ifdef TBCCTL1_
			return TBCCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL2() {
#ifdef TBCCTL2_
			return TBCCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL3() {
#ifdef TBCCTL3_
			return TBCCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL4() {
#ifdef TBCCTL4_
			return TBCCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL5() {
#ifdef TBCCTL5_
			return TBCCTL5_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL6() {
#ifdef TBCCTL6_
			return TBCCTL6_;
#else
			return 0;
#endif
		}


		unsigned int getTBIV() {
#ifdef TBIV_
			return TBIV_;
#else
			return 0;
#endif
		}


		unsigned int getTIMERB0_VECTOR() {
#ifdef TIMERB0_VECTOR
			return TIMERB0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMERB1_VECTOR() {
#ifdef TIMERB1_VECTOR
			return TIMERB1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getINTVECT() {
#ifdef INTVECT
			return INTVECT;
#else
			return 0;
#endif
		}


		unsigned int getUSISR() {
#ifdef USISR_
			return USISR_;
#else
			return 0;
#endif
		}


		unsigned int getUSICTL() {
#ifdef USICTL_
			return USICTL_;
#else
			return 0;
#endif
		}


		unsigned int getUSICCTL() {
#ifdef USICCTL_
			return USICCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUSI_VECTOR() {
#ifdef USI_VECTOR
			return USI_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUCA0CTL0() {
#ifdef UCA0CTL0_
			return UCA0CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0CTL1() {
#ifdef UCA0CTL1_
			return UCA0CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0BR0() {
#ifdef UCA0BR0_
			return UCA0BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0BR1() {
#ifdef UCA0BR1_
			return UCA0BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0MCTL() {
#ifdef UCA0MCTL_
			return UCA0MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0STAT() {
#ifdef UCA0STAT_
			return UCA0STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0RXBUF() {
#ifdef UCA0RXBUF_
			return UCA0RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0TXBUF() {
#ifdef UCA0TXBUF_
			return UCA0TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0ABCTL() {
#ifdef UCA0ABCTL_
			return UCA0ABCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0IRTCTL() {
#ifdef UCA0IRTCTL_
			return UCA0IRTCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0IRRCTL() {
#ifdef UCA0IRRCTL_
			return UCA0IRRCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0CTL0() {
#ifdef UCB0CTL0_
			return UCB0CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0CTL1() {
#ifdef UCB0CTL1_
			return UCB0CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0BR0() {
#ifdef UCB0BR0_
			return UCB0BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0BR1() {
#ifdef UCB0BR1_
			return UCB0BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0MCTL() {
#ifdef UCB0MCTL_
			return UCB0MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0I2CIE() {
#ifdef UCB0I2CIE_
			return UCB0I2CIE_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0STAT() {
#ifdef UCB0STAT_
			return UCB0STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0RXBUF() {
#ifdef UCB0RXBUF_
			return UCB0RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0TXBUF() {
#ifdef UCB0TXBUF_
			return UCB0TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0I2COA() {
#ifdef UCB0I2COA_
			return UCB0I2COA_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0I2CSA() {
#ifdef UCB0I2CSA_
			return UCB0I2CSA_;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB0TX_VECTOR() {
#ifdef USCIAB0TX_VECTOR
			return USCIAB0TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB0RX_VECTOR() {
#ifdef USCIAB0RX_VECTOR
			return USCIAB0RX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUCA1CTL0() {
#ifdef UCA1CTL0_
			return UCA1CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1CTL1() {
#ifdef UCA1CTL1_
			return UCA1CTL1_;
#else
			return 0;
#endif
		}


